{
    "intents": [
        {
            "tag": "request_data",
            "patterns": [
                "Who is mozzart",
                "What do you know about Method Man",
                "Who is the most successful musician",
                "Can you tell me more about the life of Freddie Mercury?",
                "What are some of the biggest hits from Michael Jackson?",
                "Who is the lead guitarist of Guns N' Roses?",
                "What was the first album released by Led Zeppelin?",
                "Can you provide me with information about the origins of hip hop?",
                "What is the most popular genre of music in the United States?",
                "Who was the first female rapper to win a Grammy award?",
                "What was the name of Prince's backup band?",
                "What inspired the Beatles to write 'Let It Be'?",
                "Can you tell me more about the history of the Rolling Stones?",
                "Tell me about Pink Floyd's Dark Side of the Moon album",
                "What is the story behind Michael Jackson's Thriller song?",
                "Can you give me some information about Johann Sebastian Bach?",
                "Tell me about Pink Floyd's Dark Side of the Moon album",
                "What is the story behind Michael Jackson's Thriller song?",
                "Who are NWA",
                "Who are the beatles",
                "Who are the platinum rock legends",
                "Who do you consider a popstar",
                "What u know bout amy whinehouse",
                "who are guns n roses",
                "something about 50 cent",
                "what u know bout project pat",
                "what u know bout new orleans jazz",
                "what is your knowledge of house music",
                "Can you tell me more about Beyoncé?",
                "Who are some other artists like Adele?",
                "What are some of Michael Jackson's biggest hits?",
                "Can you recommend some music by Taylor Swift?",
                "What's the story behind David Bowie's 'Ziggy Stardust' persona?",
                "What are some popular songs by Justin Bieber?",
                "I'm a big fan of Ed Sheeran. What are some of his best songs?",
                "What can you tell me about the Beatles?",
                "What are some of Madonna's most iconic moments?",
                "Who are some contemporary artists in the rap genre?",
                "Can you recommend some good classical music?",
                "What's the difference between jazz and blues music?",
                "What are some popular electronic music genres?",
                "Can you tell me more about heavy metal music?",
                "What are some popular punk rock bands?",
                "What is reggae music and who are some popular reggae artists?",
                "What is country music and who are some popular country artists?",
                "Can you recommend some good indie rock bands?",
                "What are some popular hip hop subgenres?",
                "What are some good examples of experimental music?",
                "What are some of the best albums of all time?",
                "Can you recommend some classic rock albums?",
                "What are some good jazz albums for beginners?",
                "Can you tell me more about Pink Floyd's 'Dark Side of the Moon' album?",
                "What are some good indie albums from the last decade?",
                "What is the story behind Kendrick Lamar's 'To Pimp a Butterfly' album?",
                "What are some popular R&B albums from the 90s?",
                "Can you recommend some good electronic albums?",
                "What are some essential hip hop albums?",
                "What are some good live albums?",
                "Can you tell me more about the Rolling Stones?",
                "What are some popular Beatles covers by other artists?",
                "What are some good Fleetwood Mac songs?",
                "Can you recommend some good Radiohead albums?",
                "What is the story behind Nirvana's 'Nevermind' album?",
                "What are some good Led Zeppelin songs?",
                "What are some popular Pearl Jam songs?",
                "What are some good Red Hot Chili Peppers albums?",
                "What can you tell me about the history of the Grateful Dead?",
                "What are some popular songs by the Eagles?",
                "Can you tell me more about Beethoven's 9th Symphony?",
                "What are some good contemporary classical compositions?",
                "What can you tell me about Mozart's 'Requiem' composition?",
                "What are some good film score compositions?",
                "Can you recommend some good piano compositions?",
                "What are some popular opera compositions?",
                "What are some good examples of minimalist music?",
                "What are some good orchestral compositions?",
                "What can you tell me about Vivaldi's 'Four Seasons' composition?",
                "What are some popular choral compositions?",
                "Can you tell me more about Bach's life?",
                "What can you tell me about Mozart's musical style?",
                "What are some good contemporary classical composers?",
                "What can you tell me about Tchaikovsky's works",
                "I'm feeling some old-school hip hop vibes. Can you recommend some classic tracks?",
                "Yo, what's the deal with Lil baby? Any new songs out?",
                "I'm feeling some old-school hip hop vibes. Can you recommend some classic tracks?",
                "Hey, who's that singer with the deep voice that sings 'Take Me to Church'?",
                "What's the best punk rock album to listen to while driving?",
                "I'm in the mood for something moody and introspective. Got any emo music recommendations?",
                "What's the difference between trap music and drill music?",
                "I'm trying to get into country music. What are some good songs to start with?",
                "Who are some up-and-coming indie artists that I should check out?",
                "Hey, what's the name of that song that goes 'you're beautiful, it's true'?",
                "Can you recommend some jazz fusion albums that mix jazz with other genres?",
                "What's the name of that band that sings 'I Will Wait'?",
                "Who are some underrated rock bands that deserve more attention?",
                "What are some good workout songs to get pumped up?",
                "What's the story behind Kendrick Lamar's 'Good Kid, M.A.A.D City' album?",
                "I'm looking for some chill electronic music to listen to while I work. Any suggestions?",
                "Who are some female rappers that are killing it right now?",
                "What are some good movie soundtracks to listen to?",
                "Can you recommend some good house music tracks for a party?",
                "Who are some popular Latin music artists?",
                "What's the name of that EDM song that goes 'baby you should take it slow'?",
                "What are some good metal bands that aren't too heavy?",
                "I'm trying to expand my music taste. What are some good world music genres to explore?",
                "What are some good road trip songs to sing along to?",
                "What's the name of that song that has the catchy whistle melody?",
                "Can you recommend some good classical guitar music?",
                "What are some good jazz vocalists that I should check out?",
                "Who are some popular hip hop producers that make beats for other artists?",
                "What are some good songs to listen to when you're feeling nostalgic?",
                "What's the name of that rock song that goes 'living on a prayer'?",
                "Can you recommend some good ambient music to listen to while meditating?",
                "Who are some popular K-pop groups?",
                "What are some good indie pop artists that make happy, upbeat music?",
                "What's the story behind Jay-Z's 'The Blueprint' album?",
                "I'm looking for some good instrumental music to study to. Any recommendations?",
                "Who are some popular alternative rock bands from the 90s?",
                "What are some good bluegrass bands to check out?",
                "What's the name of that pop song that goes 'I got my driver's license last week'?",
                "Can you recommend some good French music?",
                "What are some good bossa nova songs?",
                "Who are some popular female rock musicians?",
                "I'm in the mood for some upbeat, funky music. What do you suggest?",
                "What's the name of that electronic song that has the robotic voice saying 'around the world'?",
                "Can you recommend some good ambient metal bands?",
                "Who are some popular grunge bands from the 90s?",
                "Can you suggest some indie bands that are similar to The Strokes?",
                "I'm looking for some relaxing instrumental music. Any recommendations?",
                "What are some good reggae albums to listen to?",
                "Can you suggest some electronic dance music artists for a party playlist?",
                "What are some popular hip hop songs from the 00s?",
                "I'm interested in learning about classical music. Can you recommend some famous composers to start with?",
                "Can you suggest some Spanish language music that's popular right now?",
                "I'm a fan of heavy metal. What are some new releases that I should check out?",
                "What are some good rock songs with catchy guitar riffs?",
                "Can you recommend some jazz songs with great saxophone solos?",
                "I'm in the mood for some upbeat pop music. Any suggestions?",
                "What are some good alternative rock bands from the 2000s?",
                "I want to discover new music from Africa. Can you recommend some popular artists or bands?",
                "Can you suggest some country music with a classic sound?",
                "What are some good instrumental rock songs?",
                "I'm looking for some mellow acoustic music. Any recommendations?",
                "Can you recommend some rap songs with positive messages?",
                "I'm interested in discovering some experimental music. What are some good artists to check out?",
                "What are some good metalcore bands with female vocalists?",
                "Can you suggest some songs with catchy basslines?",
                "I'm looking for some Irish folk music. Any recommendations?",
                "What are some good soul songs with powerful vocals?",
                "Can you recommend some electronic music with a chill vibe?",
                "Can you suggest some trap music for a workout playlist?",
                "I'm looking for some indie pop music that's perfect for summer. Any recommendations?",
                "What are some good R&B albums that came out this year?",
                "Can you recommend some lo-fi hip hop beats for studying?",
                "I'm interested in discovering some new EDM artists. Who should I be listening to right now?",
                "What are some good rock albums that came out in the last few months?",
                "Can you suggest some alternative songs that are perfect for road trips?",
                "I'm looking for some chill indie music with good vibes. Any suggestions?",
                "What are some good rap albums that were released in the last year?",
                "Can you recommend some electronic music that's perfect for a night out?",
                "I'm interested in discovering some new pop punk bands. Who should I check out?",
                "What are some good metal songs that were released recently?",
                "Can you suggest some songs that are perfect for a rainy day?",
                "I'm looking for some indie folk music that's perfect for fall. Any recommendations?",
                "What are some good soul albums that came out in the last year?",
                "Can you recommend some ambient music for meditation?",
                "I'm interested in discovering some new post-punk bands. Who should I be listening to?",
                "What are some good hip hop songs with social commentary that were released recently?",
                "Can you suggest some pop songs that have catchy hooks?",
                "Who are some up-and-coming country artists to listen to?",
                "What's a good classical composition for studying?",
                "Can you recommend some new jazz releases?",
                "What's a good reggae album to listen to on a sunny day?",
                "info",
                "give info",
                "can u give info",
                "Hello musichub, which is the most popular edm festival?",
                "can i get info about",
                "who is the most popular jazz musician",
                "who is anderson paak",
                "tell me bout classical music",
                "can i get some info bout hard rock",
                "can u give some information about get rich or die trying album",
                "give me information about most popular deep house festivals",
                "can i get info about some music festival",
                "can u give me something about jim morrison",
                "where is exit festival",
                "when is the next introduction to rock n roll hall of fame",
                "when is next project pat live",
                "who is in club 27",
                "which are first trap artists",
                "information",
                "do u have some data about antonio vivaldi",
                "jim morrison bio",
                "can i get juicy j bio",
                "give me BIGs biography",
                "give me some data about baroque musicians",
                "who are the first pop bands",
                "which are most popular artist right now",
                "whose album is get rich or die trying",
                "whose song has most views on yt",
                "which album has sold most copies",
                "give me some punk history data",
                "can i get a brief explanation on origins of hiphop",
                "explain me briefly the difference between metal and rock",
                "give me an explanation on how clarinet works",
                "Hi, musichub do u know who is the first jazz musician?",
                "Yo musichub which rapper sold most records",
                "Sup bro when did beethoven write his first symphony",
                "Hi, can u give me some info about neosoul",
                "give me some knowledge about rico recklezz",
                "who r nwa members",
                "Music hub can u give me dj pauls biography",
                "Hi, can u give me some lil baby news",
                "gimme some news for rock n roll hall of fame",
                "when will jorja smith release new album",
                "why is dababy cancelled",
                "gimme adele bio",
                "can i get jessie reyez bio",
                "any news on exit festival?",
                "any updates on eminems next mixtape",
                "Can u summarize music history",
                "gimme some blues music history"
            ],
            "responses": []
        },
        {
            "tag": "play_music",
            "patterns": [
                "Play eminem not afraid",
                "Play Method man-gotta have it",
                "Play some ac/dc hits",
                "Hi, give me an Led Zeppelin song",
                "Play Michale Jackson Thriller",
                "Can you play Bohemian Rhapsody by Queen?",
                "I want to listen to 'Stairway to Heaven' by Led Zeppelin.",
                "Play 'Shape of You' by Ed Sheeran.",
                "Give me some rolling stones hit",
                "Can you play a rock song?",
                "I'm in the mood for some jazz music.",
                "Can you play some hip hop music?",
                "Give me some rock hits",
                "Play some house music",
                "Hi, can u play some rap",
                "Give me some rock n roll vibes",
                "Can u play some rnb",
                "I want to listen to some dubstep",
                "I'm in the mood for some classical music.",
                "Play something",
                "Play some music",
                "Give me some hits",
                "Give me a song",
                "Can u play?",
                "Hey Music Hub, gimme some rock?",
                "Can you put on some electronic dance music, please?",
                "I'm in the mood for some R&B. Can you play me some?",
                "Can you play some classical music in the background while I work?",
                "Hey MusicHub, play 'Watermelon Sugar' by Harry Styles?",
                "Can you play 'Good 4 U' by Olivia Rodrigo, please?",
                "I'm in the mood for some Drake. Can you play 'Laugh Now Cry Later'?",
                "I'm feeling nostalgic. Can you play 'I Will Always Love You' by Whitney Houston?",
                "Hey Music Hub, can you play the 'Folklore' album by Taylor Swift?",
                "Can you play the 'Happier Than Ever' album by Billie Eilish, please?",
                "I'm in the mood for some Lana Del Rey. Can you play the 'Born to Die' album?",
                "Can you play the 'Thriller' album by Michael Jackson for me?",
                "I'm in the mood for some Beatles. Can you play 'Abbey Road'?",
                "Hey MusicHub, can you play the 'Moonlight Sonata' by Beethoven?",
                "Can you play the 'Brandenburg Concerto No. 3' by Bach, please?",
                "I'm in the mood for some Mozart. Can you play 'Eine Kleine Nachtmusik'?",
                "Can you play 'Rhapsody in Blue' by George Gershwin for me?",
                "I'm in the mood for some Chopin. Can you play the 'Prelude in E Minor'?",
                "Play some of the top tracks in the reggae genre.","Can you play some EDM?",
                "Can you play some reggae tunes?",
                "I want to listen to some blues music",
                "Can you play some Spanish guitar music?",
                "Can you play some 90s hits?",
                "I want to listen to some funk music",
                "Can you play some disco tunes?",
                "Can you play some bossa nova?",
                "Can you play some garage rock?",
                "I want to listen to some prog rock",
                "Can you play some trap metal?",
                "I'm in the mood for some dark ambient",
                "I'm feeling like some noise pop",
                "Can you put on some art rock?",
                "I'm in the mood for some neoclassical music",
                "gimme some song from mmlp2",
                "gimme some new popular edm track",
                "give me some jazz",
                "gimme some neo-soul",
                "gimme some popular hard rock song"
            ],
            "responses": []
        },
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Good evening",
                "Whats up",
                "Hey",
                "Greetings!",
                "Nice to see you!",
                "How's it going?",
				"How are you doing?",
				"Nice to meet you.",
				"How do you do?",
				"It is a pleasure to meet you.",
				"Top of the morning to you!",
                "Hey there",
                "Heya",
                "good day",
                "howdy",
                "yo",
                "sup bro",
                "sup musichub"
            ],
            "responses": [
                "Hello!",
                "Hey!",
                "Hi there, how can I help?",
                "How can i help you?",
                "Hi :)"
            ]
        },
        {
            "tag": "introduction",
            "patterns": [
                "Are u MusicHub",
                "who are you",
                "Hi whats your name?",
                "How should i call u?",
                "Who is music hub",
                "may I know your name?",
                "Could you introduce yourself?",
                "Pardon me, I don't think we've met yet.",
                "Hi, I'm sorry I don't recognize you. Could you tell me your name?",
                "I don't think we've met before.",
                "What do you know about Music Hub?",
                "who r u",
                "Who is musichub",
                "how u called",
                "are u some chatbot"
            ],
            "responses": [
                "Hello my name is MusicHub, im an AI Assistant for music. :)\nIf u need some music related information, or u want to listen to some music, let me know!",
                "Hi im MusicHub, how can i help you?",
                "Im an Intelligent Virtual Assistant called MusicHub :)",
                "Hello, I'm MusicHub! Whether you want to have a conversation about music or listen to some tunes, I'm always here to lend an ear.",
                "Hello there, I'm MusicHub, your personal AI music assistant. If you need help discovering new songs or want to chat about your favorite artists, let me know!",
                "Greetings, I'm MusicHub, your go-to source for all things music-related. Whether you want to learn about music history or explore different genres, I'm here to guide you.",
                "Hi, I'm MusicHub, your virtual music companion."
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "cya",
                "See you later",
                "Goodbye",
                "I am Leaving",
                "Have a Good day",
                "bye",
                "see ya",
                "Take care!",
                "Have a nice day!",
                "It was nice talking to you!",
                "Catch you later!",
                "I'm off.",
                "Good night!",
                "talk to u later",
                "I've got to get going",
                "Peace",
                "Im out",
                "see u",
                "i gotta take off",
                "I have to go, see u later"
            ],
            "responses": [
                "Bye.",
                "Have a nice day!",
                "See ya :)",
                "Goodbye!",
                "Take care!"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thank's a lot!",
                "Thank you so much!",
                "I really appreciate it!",
                "I can't thank you enough!",
                "You're the best, thank you!",
                "Thank you for your help!",
                "I owe you one!",
                "I appreciate your help.",
                "You are amazing, thank you!",
                "Many thanks"
            ],
            "responses": [
                "Happy to help!",
                "My pleasure!",
                "No problem!",
                "Not a problem at all!",
                "You're welcome!",
                "No worries!",
                "Don't mention it!",
                "Anytime!",
                "Glad to help!"
            ]
        }
    ]
}