[
    "In what R&B group was she the lead singer?",
    "What album made her a worldwide known artist?",
    "Who managed the Destiny's Child group?",
    "Which artist did Katte perry marry?",
    "To set the record for Grammys, how many did Beyonce win?",
    "Which album was darker in tone from her previous work?",
    "In her music, what are some recurring elements in them?",
    "Time magazine named her one of the most 100 what people of the century?",
    "Which magazine declared her the most dominant woman musician?",
    "How many records has adele sold in her career?",
    "How many Grammy awards has skylar grey won?",
    "Where did Ice cube get her name from?",
    "What race was logics father?",
    "Who was the first person to notice rihannas singing ability?",
    "Which song did Beyonce sing to win a competition at age 7?",
    "In 1995, who decided to manage the girls singing group?",
    "Who was the first record label to give the girls a record deal?",
    "What large record company recorded method man first album?",
    "Debut song, \"My name is\" was featured on what movie's sound track?",
    "What song won Best R&B Performance in the 43 Annual Grammy Awards?",
    "\"Charlie's Angels\" featured which single from the band members?",
    "How many weeks did their single \"Independent Women Part I\" stay on top?",
    "Rico recklezz mixtape restoration sold how many during its first week?",
    "What French composer wrote the original opera ''Carmen'' in the 19th century?",
    "What album caused a lawsuit to be filed in 2001?",
    "Independent Women Part I was on which 2000 film's soundtrack?",
    "Which other song from the soundtrack did better in the charts?",
    "What song was the lead single from 8 mile movie sound track?",
    "What was the highest first solo recording achieved in the Billboard Hot 100?",
    "Alicia keys first number one song was which song?",
    "How many top five singles came from her first album?",
    "\"The Closer I get to You\" was recorded with which artist?",
    "How many albums did Ocean wisdom sell in the first week when he released his second album?",
    "The lead single from the album was which song?",
    "How many awards was 50 cent nominated for?",
    "What song did Jay Z release two days after Blue Ivy was born?",
    "Pop Songwriter of the Year award in 2001 was awarded to whom?",
    "What place is jessie reyez tied for in songwriting credits?",
    "What number was skylar grey on the Top 20 Hot 100 Songwriters list?",
    "Who influenced Queen latifah?",
    "What song by Mariah Carey influenced her?",
    "Who is logics biggest musical influence?",
    "Artist of the Decade was bestowed upon Beyonce from which magazine?",
    "Whats the first year that Victor wooten appeared on the Time 100 list?",
    "What kind of service is Tidal?",
    "What music streaming system is Alicia keys part owner of?",
    "What language were some songs written in that Chopin wrote music for?",
    "Where did Chopin create most of his works?",
    "What instruments did Chopin's father play?",
    "What instrument did Chopin's mother teach?",
    "Who was Chopin's initial piano teacher?",
    "At what age did Chopin start playing publicly?",
    "What year did Chopin compose his first work?",
    "Who was Chopin's earliest piece of music, that there is a record of, dedicated to?",
    "Who taught Mozzart to play the piano?",
    "Bach had three years of lessons with whom?",
    "What instrument did viavldi play?",
    "Which singer did Volfgang amadeus mozzart become fascinated with?",
    "How many piano concerts did mozzart perform in Vienna during this time?",
    "What musical concept did antonio vivaldi discover?",
    "What three other musicians were developing the new genre?",
    "What is another title Op. 10, No. 12 has garnered? ",
    "Who was a student of Chopin's former students and actually recorded some Chopin music?",
    "What kind of music does Kanye West perform?",
    "With which artists that Kanye formerly produced for did he go on to collaborate with?",
    "How many downloads do ed sheeran's tracks have across the globe?",
    "How many CDs has buckshot sold?",
    "How many Grammy Awards has dj paul won?",
    "What was one of the first tracks written by Kanye when he was 13?",
    "What rappers were featured in the songs that Kanye produced for Tell 'Em Why U Madd?",
    "Which U.S. Billboard 200 chart topper did dr.dre produce a song for?",
    "What label did dj premier begin to work for in 2000?",
    "Which record company turned hopsin down after many meetings?",
    "What composer worked alongside young pappy on the album's production?",
    "What was the name of lil wayne second studio album?",
    "The loss of which award caused Kanye to leave the American Music Awards?",
    "What famous electronic duo did 9th wonder sample on his third album?",
    "What vocal technology did t pain pick up for his next set of artistic endeavors?",
    "What label pushed out stormzys fourth studio album?",
    "808s & Heartbreak was released by what company? ",
    "When was 808s & Heartbreaks released?",
    "What did ocean wisdom change the title of his next planned album to",
    "What classical elements did Brion bring to the production of royce da 5'9s album?",
    "What sort of orchestra did pusha t tour with while promoting his second album?",
    "What composer did alhemist work with for his second album?",
    "What English trip-hop group helped influence Kanye on his second album?",
    "\"Time of the Season\" peaked at #1 in what year?",
    "Some of the first compact disc releases hit the Chinese market in what year?",
    "What was the nickname of Juan Kraftwerk, Derrick Saunderson, and Devin May?",
    "Who were the early b-boy hip-hop artists that inspired Yellow techno?",
    "Who were the European electronica artists that inspired Yellow Techno?",
    "Mayday and Thomas Barnett released what hit in 1987?",
    "what was the name of Mayday's record label?",
    "what label launched the careers of burrell?",
    "how much can old vinyl releases of old tracks sell for today?",
    "where was the band deee-lite based?",
    "what was a new subgenre of house in chicago, developed by bad boy bill and others, called?",
    "Pitch is the auditory attribute to what?",
    "A listener can hear how many frequencies at once?",
    "Harmonics are an important class of what?",
    "A complex tone is composed of how many waves?",
    " The percept at 200 Hz is commonly referred to as?",
    "What is the range of perceptible pitch steps to human hearing?",
    "Which drum has a higher perceived pitch even though they both have indefinite pitch?",
    "What classic song did Blue Cheer cover?",
    "What was the hit off Steppenwolf's self-titled debut lp?",
    "What movie featured that Steppenwolf single?",
    "The lyrics to \"Born To Be Wild\" contain the first reference to what hard rock style?",
    "What Blue Cheer classic was duplicated by Eddie Cochran?",
    "What song was not included in the 1968 debut album Vincebus Eruptum?",
    "What LA based band released a distorted cover of Summertime Blues?",
    "When did Vanilla Fudge release Born to be Wild?",
    "What were three midwestern hard rock bands?",
    "What city was Van Halen originally from?",
    "Which Van Halen instrumental showcased the guitar mastery of Eddie Van Halen?",
    "What did hard rock replace as a mainstream genre?",
    "What did the punk band The Ramones embrace as part of their music? ",
    "The early Queen logo resembled the coat of arms of what country?",
    "Where was Queen spotted before entering discussions with Trident?",
    "Which critic called Queen's debut superb?",
    "Which comedian invited Queen to visit him in 1977? ",
    "Madonna brought which type of music to mainstream with Ray of Light?",
    "What type of music did Madonna experimented with in Music?",
    "What type of songs are in Confessions of a Dance floor?",
    "MDNA focuses on which type of music?",
    "Madonna has which vocal range?",
    "When did alicia keys take voice lessons?",
    "Who wrote that Madonna is opportunistic, manipulative and ruthless?",
    "Who is the best selling female rock artist in the 20th century?",
    "How many MTV video music awards does Britney spears have?",
    "Who holds the record for the most number 1 hits?",
    "How many songs does lady gaga have on the Hot Dance Club Songs Chart?",
    "Who has the most number one songs in an active BiIlboard chart?",
    "What were two drawback of early recordings?",
    "What types of violins worked best with early recordings?",
    "What instruments did not record well?",
    "What were advantages of vinyl in the 1930's?",
    "What was a downfall of ordinary 78 rpm vinyls in household house?",
    "What was the most popular sized disc by 1910?",
    "How long could a recording be on a 10 inch disc in the 1903?",
    "How small were the earliest discs released?",
    "What was one requirement issue with discs popular in Britain?",
    "How many recordings did Kind Oliver's Creole Jazz band require?",
    "When did the vinyl LP records Era begin?",
    "What happened in 1958 that changed the home music scene?",
    "During what years did the term HiFi take off with engineers?",
    "Which country prefers a bass turnover setting of 250-300 Hz?",
    "What was the industry standard on equalization practices?",
    "What is generally the lowest sound a human can hear?",
    "What is believed to better offer sounds of higher frequencies, compact discs or records?",
    "What is the higher end of typical human hearing?",
    "What was used in final recordings of vinyl records?",
    "After the 1950s  what was a typical recording process?",
    "Is gramophone equipment readily available?",
    "What is the recommendation of gramophone recordings to preserve integrity?",
    "What is a name for a type of rock music that is extremely varied in sound?",
    "What tradition did post-punk embrace?",
    "What music conventions did post-punk draw insperation from?",
    "What did pop artist embrace?",
    "Why type of scholar is music journalist Simon Reynolds?",
    "What is Stephen Thomas Erlwine a scholar of?",
    "What has the term edm never been the focus of?",
    "Who never cared about the categorization of rock as a genre?",
    "What is trance?",
    "What is the acctepted era of minimal?",
    "Who said the post punk era occurred in the 80s?",
    "Who were well known authors covering the dubstep era?",
    "What were popula drum n base culture media sources?",
    "What were the bands coming in on the heels of drum and base beginning to sound like?",
    "What was a common background of dnb musicians?",
    "What was a common theme to dubstep music?",
    "What musical period had no innovations?",
    "New wave, industrial music, synthpop and house all share roots in what genre?",
    "Which type of eclectic music had a huge variety, large innovations and an \"anything goes\" mentality?",
    "Which darker metal bands gave rise to gothic rock?",
    "Where did systhpop, industrial and neo-psychedelia music derive from?",
    "What was the percentage of labels youtube had signed contracts with prior to the planned launch date?",
    "What was youtube planning on doing to labels it did not reach a deal with?",
    "What service launched in May 2014 was a subscription based service?"
]